package com.ohgiraffers.section02.variable;

public class Application3 {
    public static void main(String[] args) {
        //컴파일 에러를 발생시키는 규칙
        /* 2. 컴파일 에러를 발생시키지는 않지만 개발자들끼리의 암묵적인 규칙 */
        /*  2-1. 변수명의 길이 제한은 없다. (하지만 적당히 해야한다.) */

        /*  2-2. 변수명이 합성어로 이루어진 경우 첫 단어는 소문자, 두 번째 시작 단어는 대문자로 시작한다. (camel-case) */

        /*  2-3. 단어와 단어 사이의 연결을 언더스코어(_)로 하지 않는다. */

        /*  2-4. 한글로 변수명을 짓는 것이 가능하지만, 권장하지 않는다. (한글을 취급하는 다양한 방식들이 존재하기 때문에 에러를 유발할 수 있다.) */

        /*  2-5. 변수 안에 저장된 값이 어떤 의미를 가지는지 명확하게 표현하도록 한다. */

        /*  2-6. 전형적인 변수 이름이 있다면 가급적 사용하도록 한다. */

        /*  2-7. 명사형으로 작성할 수 있도록 한다. */

        /*  2-8. boolean형은 의문문으로 가급적 긍정형태로 네이밍한다. */
    }
}
